#!/usr/bin/env python
# coding: utf-8

# In[41]:


numbers=list(range(1,101))


# In[42]:


characters=['空','东风','何处','人间','风流','归去','春风','西风','归来','江南','相思','梅花',
            '千里','回首','明月','多少','如今','阑干','年年','万里','一笑','黄昏','当年','天涯',
            '相逢','芳草','尊前','一枝','风雨','流水','依旧','风吹','风月','多情','故人','当时',
            '无人','斜阳','不知','不见','深处','时节','平生','凄凉','春色','匆匆','功名','一点',
            '无限','今日','天上','杨柳','西湖','桃花','扁舟','消息','憔悴','何事','芙蓉','神仙',
            '一片','桃李','人生','十分','心事','黄花','一声','佳人','长安','东君','断肠','而今',
            '鸳鸯','为谁','十年','去年','少年','海棠','寂寞','无情','不是','时候','肠断','富贵',
            '蓬莱','昨夜','行人','今夜','谁知','不似','江上','悠悠','几度','青山','何时','天气',
            '惟有','一曲','月明','往事']


# In[45]:


songci=dict(zip(numbers,characters))


# In[ ]:


# numstr=eval(input('请输入一串数字'))
# nums=list(map(int,numstr))
# print(nums)

nums = input('请输入一串数字')
# if not nums.isdigit():
#     print('输入错误')
#     exit()
result = []
for i in range(0, len(nums), 2):
    if i+1 >= len(nums):
        # 到最后了
        result.append((songci[int(nums[i:])]))
    else:
        result.append(songci[int(nums[i:i+2])])

# 打印结果
for word in result:
    print(word, end='')

# %%
